[
  {
    "start": 0.0,
    "text": " Bounce track to new place now this one's very clutch and this is something that I recommend you guys do a lot"
  },
  {
    "start": 5.8,
    "text": " When you have a song like this"
  },
  {
    "start": 15.88,
    "text": " Let's say that I decide to grab the moan and what I can do now is use plugins or a combination of Ableton effects in"
  },
  {
    "start": 22.88,
    "text": " Order to create some ear candy out of that sound infiltrators one of my favorite plugins that I like to use"
  },
  {
    "start": 30.8,
    "text": " It doesn't gnarly stuff"
  },
  {
    "start": 32.32,
    "text": " So now what I can do is I can highlight this section right click and bounce to new track"
  },
  {
    "start": 37.44,
    "text": " No pun intended with the song which is called bounce to be fair, but now I can do that"
  },
  {
    "start": 42.72,
    "text": " It's gonna bounce it down for me. Bring it down just this highlighted area and I'm gonna have this at the bottom"
  },
  {
    "start": 50.16,
    "text": " Had it somewhere for your candy, right?"
  },
  {
    "start": 52.0,
    "text": " Hey, let's say that I follow the idea here that I did for the the snares accenting them on the on the fourth hit"
  },
  {
    "start": 61.0,
    "text": " I"
  },
  {
    "start": 63.6,
    "text": " Have this"
  },
  {
    "start": 65.84,
    "text": " The next big thing too is the auto filter"
  },
  {
    "start": 68.04,
    "text": " I'm actually gonna end up using it now because usually I'll use the cue, you know and do like, you know cuts like this"
  },
  {
    "start": 72.64,
    "text": " For like the track or like, you know some sweeps and stuff"
  },
  {
    "start": 75.68,
    "text": " But now the new auto filter just looks so nice that you just want to touch it, right?"
  },
  {
    "start": 79.24000000000001,
    "text": " You just want to point your finger at it"
  },
  {
    "start": 80.72,
    "text": " And if you have a touchscreen Mac then or a touchscreen computer man. Hey first off we can now see where"
  },
  {
    "start": 86.96000000000001,
    "text": " the LFO is"
  },
  {
    "start": 90.0,
    "text": " In correlation to what what's going on in the song. So if I'm playing the song I"
  },
  {
    "start": 97.32,
    "text": " Can see what it's doing different filters like pretty much the DJ filter"
  },
  {
    "start": 104.08,
    "text": " You can do this really cool effect that feels like you're sucking everything in"
  },
  {
    "start": 117.2,
    "text": " We have a comb filter now so we can be like dubstep be that's a movement"
  },
  {
    "start": 123.44,
    "text": " Yeah, make it sound more expensive high-tech"
  },
  {
    "start": 135.08,
    "text": " It sounds like a big crusher and sounds like a sample and hold almost like the sample and hold filter inside of serum 2"
  },
  {
    "start": 140.4,
    "text": " We're also gonna have a notch and low pass, which is welcomed"
  },
  {
    "start": 150.92000000000002,
    "text": " And then the morph allows you to control the position of that"
  },
  {
    "start": 156.0,
    "text": " Notch super cool"
  },
  {
    "start": 157.52,
    "text": " You know"
  },
  {
    "start": 158.12,
    "text": " for instance"
  },
  {
    "start": 158.67999999999998,
    "text": " One of the sounds that I remade for the paradox you expect then needed a notch because Enrico Sangliano one of the best"
  },
  {
    "start": 164.32,
    "text": " producers of all time in techno"
  },
  {
    "start": 167.79999999999998,
    "text": " Uses the notch to create these really cool effects in some of his tracks like moon rocks and you know that era of"
  },
  {
    "start": 173.72,
    "text": " Enrico tracks that he had so"
  },
  {
    "start": 178.23999999999998,
    "text": " Makes it sound very and finally we have a vowel filter"
  },
  {
    "start": 183.2,
    "text": " Especially with like a sample and hold type of LFO"
  },
  {
    "start": 188.64,
    "text": " Oh"
  },
  {
    "start": 191.79999999999998,
    "text": " Super cool for adding tone and then you can also put it before"
  },
  {
    "start": 194.55999999999997,
    "text": " Distortion and do really cool stuff with that to do a bit of pre filtering deep sucking"
  },
  {
    "start": 200.11999999999998,
    "text": " Sounds with it then the sidechain feature I believe works in correlation with the envelope"
  },
  {
    "start": 206.6,
    "text": " So if I wanted to have the kick dictate the movement"
  },
  {
    "start": 209.22,
    "text": " And"
  },
  {
    "start": 216.18,
    "text": " Then from there we have the drive so we can apply some"
  },
  {
    "start": 218.82,
    "text": " Saturation to the signal as we drive the signal harder into the auto filter and then we're gonna have four different algorithms"
  },
  {
    "start": 224.82,
    "text": " Which I believe they've always been there"
  },
  {
    "start": 226.3,
    "text": " It's just again back then the way the auto filter looked it never made me want to switch the modes to MS2"
  },
  {
    "start": 232.14,
    "text": " DFM SPF PRD whatever that means sounds like ecstasy pills or some someone's shirt"
  },
  {
    "start": 236.82,
    "text": " But another cool thing that has been introduced is expressive chords now by itself"
  },
  {
    "start": 242.94,
    "text": " Expressive chords just seems to be a pack full of chords that don't really care what key you're in"
  },
  {
    "start": 249.82,
    "text": " sound very jazzy"
  },
  {
    "start": 252.62,
    "text": " On the keyboard if you play a low C and then you go to a really high C"
  },
  {
    "start": 258.06,
    "text": " You don't really jump octaves. You're pretty much just shooting off chords that have been"
  },
  {
    "start": 263.22,
    "text": " Pretty much put into this thing"
  },
  {
    "start": 266.22,
    "text": " You can also strum"
  },
  {
    "start": 271.34000000000003,
    "text": " Because that's like the thing like, you know the little the little flares"
  },
  {
    "start": 282.74,
    "text": " The way that I personally like to use it is by using a scale feature right next to it putting the the scale"
  },
  {
    "start": 289.54,
    "text": " Obviously that I'm in for the song and then just jamming out some chords"
  },
  {
    "start": 295.22,
    "text": " Looking at this and making sure the bass is hitting"
  },
  {
    "start": 297.22,
    "text": " Looking at this and making sure the bass is hitting."
  },
  {
    "start": 304.22,
    "text": " A little bit of note of the skateboard."
  },
  {
    "start": 309.22,
    "text": " Can we get something really nice?"
  },
  {
    "start": 316.22,
    "text": " Ooh, what?"
  },
  {
    "start": 317.22,
    "text": " Look at that."
  },
  {
    "start": 318.22,
    "text": " It's a little better."
  },
  {
    "start": 324.14000000000004,
    "text": " The browser has also gotten some major improvements."
  },
  {
    "start": 326.1,
    "text": " I think one of my favorite ones is by right clicking here and showing rank."
  },
  {
    "start": 329.02000000000004,
    "text": " It shows you which are the keys you've used the most here."
  },
  {
    "start": 331.18,
    "text": " So for instance, for techno, this is my most used kick as of the moment for this pack,"
  },
  {
    "start": 336.74,
    "text": " followed by all of these."
  },
  {
    "start": 337.98,
    "text": " And I haven't even touched these guys."
  },
  {
    "start": 340.18,
    "text": " So ideally, I would want to use the top one if I keep using."
  },
  {
    "start": 349.1,
    "text": " Also based on this, let's say that I have this here and I don't have it synced up properly"
  },
  {
    "start": 354.22,
    "text": " with tags."
  },
  {
    "start": 355.34000000000003,
    "text": " So let's say the techno one was in here."
  },
  {
    "start": 356.5,
    "text": " I can always add it now techno."
  },
  {
    "start": 358.82000000000005,
    "text": " So that way when I go to the browser, I can hit techno and it's going to show me all the"
  },
  {
    "start": 363.02000000000004,
    "text": " techno samples that I have."
  },
  {
    "start": 364.86,
    "text": " And obviously I can get more specific like techno bass leads, pads, and so forth."
  },
  {
    "start": 370.86,
    "text": " For instance, here, if I get rid of the pad and let's say that I find that one of them"
  },
  {
    "start": 376.12,
    "text": " is missing from the atmospheres."
  },
  {
    "start": 378.1,
    "text": " For instance, this one has the atmosphere tag here, but if I want to add pad, I can"
  },
  {
    "start": 382.70000000000005,
    "text": " add it easily."
  },
  {
    "start": 384.18,
    "text": " And there we go."
  },
  {
    "start": 386.14,
    "text": " I can create new ones if I wanted to by opening up the tag editor."
  },
  {
    "start": 388.82,
    "text": " And from there, let's say that I want to add one for bass lines that says rumble because"
  },
  {
    "start": 394.54,
    "text": " the style of music I make utilizes a lot of rumbles."
  },
  {
    "start": 397.18,
    "text": " Right, click add sub tag, call it rumbles."
  },
  {
    "start": 402.78000000000003,
    "text": " Now we have the rumbles feature."
  },
  {
    "start": 404.14,
    "text": " So now I can go to the bass group where the rumbles are located, tag them all."
  },
  {
    "start": 412.38,
    "text": " And when I add rumble, it should pop up."
  },
  {
    "start": 414.62,
    "text": " So now I have that added."
  },
  {
    "start": 415.62,
    "text": " I can close this guy."
  },
  {
    "start": 418.62,
    "text": " I can go bass and now on the bass rumbles and we're going to have those here."
  },
  {
    "start": 425.26,
    "text": " So now if I wanted to rock that, the rest of the year can now also be put to be in correlation"
  },
  {
    "start": 430.98,
    "text": " and in sync with the key that you decide to put here."
  },
  {
    "start": 433.22,
    "text": " So for instance, if I'm going to be in the key of let's say G minor for this, then I"
  },
  {
    "start": 437.38,
    "text": " can set that up."
  },
  {
    "start": 444.62,
    "text": " Say I have this."
  },
  {
    "start": 454.74,
    "text": " For some reason, I want to add a rest in here that's going to be in and in tune with that."
  },
  {
    "start": 463.42,
    "text": " So next time you get into an Ableton sesh, hopefully you use some of the techniques that"
  },
  {
    "start": 471.7,
    "text": " we talked about and maybe you organize your sample pack library so that you can make music"
  },
  {
    "start": 475.65999999999997,
    "text": " faster and better."
  },
  {
    "start": 476.97999999999996,
    "text": " Because at the end of the day, my goal is to help as many of you guys make music that"
  },
  {
    "start": 479.78,
    "text": " you can play out when you DJ."
  },
  {
    "start": 481.7,
    "text": " One of the most rewarding feelings ever."
  },
  {
    "start": 484.06,
    "text": " And with that being said, you guys take care and you guys have a great rest of your day."
  }
]