[{"text": "You've probably used or have heard of sidechain compression,", "start": 0.179, "duration": 3.732}, {"text": "but did you know there are a number of other really interesting ways to make use of sidechaining in Ableton Live?", "start": 3.911, "duration": 5.799}, {"text": "In this video, we'll take a look at all the\ndifferent ways you can use sidechains in Live", "start": 9.71, "duration": 4.03}, {"text": "and how to get the most out of them.", "start": 13.74, "duration": 2.805}, {"text": "For this video, I’ll assume you already\nknow the basics of sidechain compression in Live,", "start": 16.545, "duration": 4.644}, {"text": "but we’ll start with a quick recap and some tips and tricks to get the most out of the sidechain.", "start": 21.189, "duration": 5.154}, {"text": "We’ll then look at some other places you can use sidechains in Live,", "start": 26.343, "duration": 2.828}, {"text": "like sidechain filtering and gating.", "start": 29.171, "duration": 2.91}, {"text": "We’ll finish up with some even more advanced techniques to round out the sidechaining toolkit.", "start": 32.081, "duration": 6.389}, {"text": "The most common way to use sidechains in music production is for sidechain compression.", "start": 40.851, "duration": 4.737}, {"text": "Let’s start with a basic example and see how to set that up in Live.", "start": 45.588, "duration": 3.783}, {"text": "Here I have some synth chords and a kick drum pattern", "start": 49.371, "duration": 2.881}, {"text": "and I want to add some groove to the synth.", "start": 52.252, "duration": 2.849}, {"text": "The simplest explanation of what sidechaining is", "start": 59.547, "duration": 2.976}, {"text": "is using the signal from one track to affect the sound of another.", "start": 62.523, "duration": 3.927}, {"text": "In this example, I’ll use the signal from\nthe kick drum to sidechain compress the synth.", "start": 66.45, "duration": 4.604}, {"text": "I’ll load Live’s Compressor onto the synth track and open up the sidechain section.", "start": 71.054, "duration": 4.761}, {"text": "I’ll enable the sidechain and select the\nDrums track as the sidechain source.", "start": 76.619, "duration": 4.233}, {"text": "One of the cool things about sidechains in Live is that,", "start": 81.719, "duration": 2.757}, {"text": "if you select a Drum Rack as the source, you can select individual sounds from within that Drum Rack.", "start": 84.476, "duration": 5.324}, {"text": "In this example, I only want the sidechain to respond to the kick,", "start": 89.8, "duration": 3.213}, {"text": "not the shaker or rim that are also playing in this drum loop,", "start": 93.013, "duration": 3.219}, {"text": "so I can select just the kick drum from the second drop-down menu.", "start": 96.232, "duration": 3.497}, {"text": "Let’s take a slight diversion here because there’s often some confusion", "start": 101.18, "duration": 3.311}, {"text": "as to whether to select Pre FX, Post FX or Post Mixer from these options.", "start": 104.491, "duration": 5.63}, {"text": "Remember that sidechains work based on the level of the sidechain signal,", "start": 110.121, "duration": 3.996}, {"text": "and this could be different at different points in the signal chain.", "start": 114.117, "duration": 3.799}, {"text": "As an example, I’ll select Post Mixer for\nthe entire Drum Track as the source", "start": 117.916, "duration": 5.188}, {"text": "and now I have the current level of the Drum Track as the sidechain signal.", "start": 123.104, "duration": 4.835}, {"text": "But what if I turned down the level or muted the Drum Track?", "start": 129.0, "duration": 4.283}, {"text": "Now there’s no signal coming into the sidechain", "start": 135.049, "duration": 2.414}, {"text": "because the source is taking the level from after the mixer.", "start": 137.463, "duration": 3.146}, {"text": "If I change this to Post FX...", "start": 141.445, "duration": 1.915}, {"text": "I still get level coming into the sidechain, even when the Drums are muted.", "start": 144.921, "duration": 4.309}, {"text": "There’s no right or wrong here, it just\ndepends on what you’re trying to achieve,", "start": 149.23, "duration": 4.189}, {"text": "so be aware of this when choosing your sidechain source.", "start": 153.419, "duration": 3.128}, {"text": "I’ll switch this back to the Kick Drum and continue setting up some sidechain compression on the synth.", "start": 158.376, "duration": 5.141}, {"text": "I’ll pull the Threshold down to start getting some compression.", "start": 164.999, "duration": 3.864}, {"text": "You’ll often want to tune the timing of\nthe compressor using the Attack and Release controls,", "start": 172.556, "duration": 4.551}, {"text": "however, this is quite a boomy kick\ndrum, so the envelope of the kick,", "start": 177.107, "duration": 3.329}, {"text": "which is triggering the compression, is already quite long.", "start": 180.436, "duration": 3.221}, {"text": "This can make it tricky to fine-tune the Release.", "start": 183.657, "duration": 2.794}, {"text": "One trick you can use is to make use of the Sidechain EQ to refine the sidechain signal.", "start": 191.225, "duration": 6.174}, {"text": "I’ll solo the synth...", "start": 197.399, "duration": 1.851}, {"text": "and then enable Sidechain\nListen,", "start": 199.25, "duration": 1.983}, {"text": "so I’m now hearing the signal that’s coming into the sidechain.", "start": 201.233, "duration": 3.621}, {"text": "I’ll also switch over to the Compressor’s Envelope View,", "start": 206.746, "duration": 2.648}, {"text": "which makes it easier to see the envelope of the sidechain signal.", "start": 209.394, "duration": 4.159}, {"text": "Notice how the kick’s envelope is relatively long.", "start": 213.553, "duration": 2.933}, {"text": "I’ll enable the sidechain EQ and make sure it's on highpass.", "start": 217.511, "duration": 4.896}, {"text": "This is already making a difference, and you can see the envelope of the sidechain signal is much snappier,", "start": 222.407, "duration": 5.3}, {"text": "but we can take it further using the Frequency and Q controls.", "start": 227.707, "duration": 3.891}, {"text": "Remember that we’re currently only hearing the sidechain signal,", "start": 231.598, "duration": 2.941}, {"text": "so we won’t actually hear this in the mix.", "start": 234.539, "duration": 2.859}, {"text": "Now I have a much shorter, clickier envelope.", "start": 250.125, "duration": 3.667}, {"text": "I’ll turn Sidechain Listen off...", "start": 253.792, "duration": 2.656}, {"text": "and I now have much more accurate control over the Attack and Release values.", "start": 256.448, "duration": 4.511}, {"text": "Let’s move on to the next device that can make use of a sidechain, the Auto Filter.", "start": 280.395, "duration": 4.935}, {"text": "I’ll bring in the bass line.", "start": 285.33, "duration": 2.088}, {"text": "At the moment, this is just a series of sustained notes.", "start": 291.266, "duration": 3.165}, {"text": "But I want the bass to follow the rhythm of the kick.", "start": 294.431, "duration": 3.509}, {"text": "I’ll load Auto Filter and pull the Frequency all the way down.", "start": 297.94, "duration": 4.009}, {"text": "I’ll open Auto Filter’s sidechain section...", "start": 306.838, "duration": 2.962}, {"text": "enable the sidechain...", "start": 309.8, "duration": 1.931}, {"text": "and select the kick drum as the source.", "start": 311.731, "duration": 2.791}, {"text": "In the Auto Filter, the amount of sidechain applied is set by the Envelope control.", "start": 319.617, "duration": 5.078}, {"text": "If I turn that up, you’ll hear that the\nfrequency of the filter is being affected by the sidechain signal.", "start": 324.695, "duration": 5.583}, {"text": "If turning the Envelope control all the way to the max is still not enough,", "start": 336.892, "duration": 3.859}, {"text": "you can always use the Sidechain Gain control to increase the level of the sidechain signal.", "start": 340.751, "duration": 5.875}, {"text": "And, similar to the compressor, you can refine the timing of the response with the Attack and Release controls.", "start": 352.626, "duration": 6.697}, {"text": "The nice thing about this setup is that the rhythm of the bass will always follow the rhythm of the kick drum, even when the pattern changes.", "start": 367.861, "duration": 6.742}, {"text": "This works really nicely when you want a tight relationship between 2 elements in your track.", "start": 384.842, "duration": 5.075}, {"text": "Let’s explore some sidechain gating.", "start": 394.696, "duration": 2.727}, {"text": "I have this percussion part…", "start": 397.423, "duration": 2.292}, {"text": "…and this Synth Texture.", "start": 404.925, "duration": 2.299}, {"text": "I’d like the Synth Texture to only play\nwhen the snare in the percussion pattern hits.", "start": 414.536, "duration": 4.725}, {"text": "I’ll load Live’s Gate onto the Synth Texture...", "start": 419.261, "duration": 2.758}, {"text": "...open the sidechain and select the Perc track as the source.", "start": 424.053, "duration": 4.182}, {"text": "Already something interesting is happening, but I just want to isolate one element of the percussion loop.", "start": 436.435, "duration": 5.224}, {"text": "Unfortunately, the percussion is an audio loop, not a Drum Rack,", "start": 441.659, "duration": 3.515}, {"text": "so I can’t select individual elements as a source,", "start": 445.174, "duration": 3.171}, {"text": "but there is another trick I can use, taking advantage of Live’s flexible routing system.", "start": 448.345, "duration": 5.443}, {"text": "I’ll create a new Audio Track...", "start": 453.788, "duration": 2.095}, {"text": "...let’s call this Snare Iso...", "start": 458.359, "duration": 2.091}, {"text": "...and I’ll set the Audio Input to the Perc Track.", "start": 463.431, "duration": 2.857}, {"text": "I’ll Solo this, set the Monitor to In, the\nInput to Post FX and mute the track, so we won’t hear it in the mix.", "start": 469.868, "duration": 11.538}, {"text": "Now I can use some FX to isolate just the element I want.", "start": 481.406, "duration": 4.594}, {"text": "Again, remember that we won’t be hearing this in the mix, just using it as a sidechain source,", "start": 510.504, "duration": 4.974}, {"text": "so it doesn’t matter what it sounds\nlike.", "start": 515.478, "duration": 2.308}, {"text": "The goal here is to isolate the sound we want and turn it into a short impulse.", "start": 517.786, "duration": 4.681}, {"text": "Once I’ve isolated the bit I want,", "start": 522.467, "duration": 1.791}, {"text": "I’ll head back to the Synth Texture and set the sidechain input of the Gate to this new Snare Iso Track.", "start": 524.258, "duration": 6.104}, {"text": "And adjust the timing of the Gate.", "start": 540.512, "duration": 2.488}, {"text": "You can use this technique anytime you need to isolate a particular element from a piece of audio to use as a sidechain source.", "start": 555.939, "duration": 6.944}, {"text": "While this next tool doesn’t use sidechaining exactly, it works in the same way,", "start": 571.557, "duration": 4.457}, {"text": "using the signal from one track to affect something on another.", "start": 576.014, "duration": 3.586}, {"text": "This is the Envelope Follower and I’ll load it onto the Snare Iso Track.", "start": 579.6, "duration": 5.135}, {"text": "Envelope Follower is a Max For Live device, so you will need Max For Live to use it,", "start": 586.769, "duration": 4.303}, {"text": "but we can do some pretty fun things with it.", "start": 591.072, "duration": 2.708}, {"text": "The Envelope Follower, as the name suggests,", "start": 593.78, "duration": 2.228}, {"text": "follows the envelope of whatever sound you place it on, similar to how sidechains work.", "start": 596.008, "duration": 4.842}, {"text": "However, we can map the Envelope Follower to control almost any parameter in Live.", "start": 600.85, "duration": 5.029}, {"text": "I’ve got a Grain Delay effect set up on Return Track B.", "start": 605.879, "duration": 4.005}, {"text": "I’ll use the Snare Iso track, which, remember, is the isolated snare from the Perc Track,", "start": 619.285, "duration": 5.121}, {"text": "to affect the send to the Grain Delay.", "start": 624.406, "duration": 2.943}, {"text": "On the Envelope Follower, Click Map, then click on the control you want to map to.", "start": 627.349, "duration": 5.033}, {"text": "Then use the controls on the Envelope Follower to refine the results.", "start": 633.975, "duration": 4.033}, {"text": "Using the Envelope Follower you can effectively sidechain anything to almost anything else in Live, which can be a pretty powerful tool.", "start": 657.549, "duration": 7.427}, {"text": "We’ll wrap up with an odd, but pretty interesting use of sidechains in Live.", "start": 673.382, "duration": 4.489}, {"text": "A side effect of the Sidechain Listen button is that it essentially lets you take a signal from anywhere in Live", "start": 677.871, "duration": 5.97}, {"text": "and listen to it anywhere\nelse in Live.", "start": 683.841, "duration": 2.636}, {"text": "Let’s see an example.", "start": 686.477, "duration": 1.942}, {"text": "I’ll load another Compressor onto the Field Keys Track, before this existing sidechain compressor,", "start": 692.031, "duration": 5.429}, {"text": "and set the sidechain input to\nany other track, let’s say the bass.", "start": 700.945, "duration": 4.524}, {"text": "If I enable the Sidechain Listen, I can now hear the signal from the bass, but on the Field Keys track,", "start": 708.765, "duration": 7.001}, {"text": "and it will pass through any effects on that track, as you can hear with the Grain Delay Send.", "start": 715.766, "duration": 5.086}, {"text": "Sidechain Listening is obviously intended for auditioning your sidechain signals, as  we’ve seen,", "start": 720.852, "duration": 4.944}, {"text": "but there’s no reason you\ncan’t just leave this on.", "start": 725.796, "duration": 2.842}, {"text": "You could use the Sidechain Mix control to create a pseudo mix bus.", "start": 728.638, "duration": 4.319}, {"text": "You could group the Compressor into a Rack and create parallel chains…", "start": 737.794, "duration": 4.517}, {"text": "You can move this Compressor anywhere else in your set and absolutely anywhere in the signal flow", "start": 755.588, "duration": 4.954}, {"text": "to arbitrarily route signals to anywhere in your signal chain.", "start": 760.542, "duration": 3.694}, {"text": "To be perfectly honest I haven’t really\nfound many uses for this,", "start": 775.634, "duration": 3.252}, {"text": "but it’s pretty interesting and could come in handy at some point.", "start": 778.886, "duration": 3.147}, {"text": "Let me know if you come up with anything interesting using this technique.", "start": 782.033, "duration": 3.447}, {"text": "And that’s it for now.", "start": 787.026, "duration": 1.345}, {"text": "Which of these uses of sidechains was new to you and which of them are you gonna try in your next track?", "start": 788.371, "duration": 5.018}, {"text": "Let me know in the comments.", "start": 793.389, "duration": 1.63}, {"text": "If you’ve got any questions, feel free to\ndrop those in the comments as well", "start": 795.019, "duration": 2.981}, {"text": "and be sure to check out the links in the description for ways you can support ELPHNT", "start": 798.0, "duration": 3.668}, {"text": "and get more content for Ableton Live.", "start": 801.668, "duration": 2.446}, {"text": "Thanks for watching.", "start": 804.114, "duration": 1.23}]