[
  {
    "start": 0.0,
    "text": " Hey y'all, today we're gonna do a comparative analysis of EQ8, the Ableton"
  },
  {
    "start": 5.4,
    "text": " stock EQ plugin, and FabFilter Pro-Q3. So a little bit of background, I was"
  },
  {
    "start": 13.56,
    "text": " using EQ8 for the last like four years on everything that I was working on, and"
  },
  {
    "start": 19.88,
    "text": " it's basically just like a bare-bones EQ. It doesn't have a ton of bells and"
  },
  {
    "start": 25.44,
    "text": " whistles, but it really just gets the job done. So I didn't think that"
  },
  {
    "start": 28.6,
    "text": " there was much to be improved upon, I guess. I didn't see the point of"
  },
  {
    "start": 34.2,
    "text": " switching over to a different plugin, and then about a month ago I started"
  },
  {
    "start": 38.68,
    "text": " demoing the EQ, or the Pro-Q3 EQ plugin, and it's honestly pretty sick. So maybe"
  },
  {
    "start": 46.92,
    "text": " I'm definitely gonna buy it. So let's look at the EQs here. So I have one"
  },
  {
    "start": 54.419999999999995,
    "text": " of my tracks, one of my masters here in this session. So what we'll do is just play it, and"
  },
  {
    "start": 63.699999999999996,
    "text": " we'll look at the different features of both plugins, and you can see for"
  },
  {
    "start": 70.86,
    "text": " yourself. So, EQ8. You can double-click on the plugin in the Ableton window, and it"
  },
  {
    "start": 80.46,
    "text": " gives you a nice big view of all your audio information. It comes with four"
  },
  {
    "start": 88.74,
    "text": " nodes, kind of built in. First one's a shelf, then you've got some bells, and this one is also a shelf."
  },
  {
    "start": 105.34,
    "text": " They're numbered, so what you do is go through...if you click one, it highlights it down here, and you can adjust aspects of your EQ."
  },
  {
    "start": 120.1,
    "text": " Turning up the gain, adjusting your Q, and you can also add in more nodes by turning them on, and then they show up in the corner."
  },
  {
    "start": 140.34,
    "text": " So it's pretty straightforward workflow, and I guess that's why I've been using it"
  },
  {
    "start": 145.38,
    "text": " for so many years. It just works, you know, and you don't have to...it doesn't have a huge learning curve."
  },
  {
    "start": 152.38,
    "text": " Oh, there's also this feature where you can solo the node that you're working with, just to hear what it's doing to the audio information, which I guess is pretty easy."
  },
  {
    "start": 171.54000000000002,
    "text": " I've never really used it that much, but then you can turn on and off the Spectro."
  },
  {
    "start": 174.54000000000002,
    "text": " So yeah, that's EQ8, sort of like a workhorse EQ. So we'll turn that off. Now, Pro-Q 3. Open it up. You can see there's just a lot going on here already."
  },
  {
    "start": 195.62,
    "text": " You've got a VU meter in the side. You've got a piano roll at the bottom, which is pretty cool. You can toggle it on and off."
  },
  {
    "start": 206.62,
    "text": " And how it works is you turn it on and then you just hover your mouse over the...oh, there you go."
  },
  {
    "start": 218.70000000000002,
    "text": " You hover your mouse over the audio information and it'll generate the musical notes that you're hitting."
  },
  {
    "start": 231.70000000000002,
    "text": " So you can see how that could be useful, right, when you're working on a track. And you can turn that off if you don't like it."
  },
  {
    "start": 242.78,
    "text": " My favorite thing about this plugin is this feature called...if you hover over it, it's called Spectrum Grab."
  },
  {
    "start": 253.78,
    "text": " And basically, as you can see, it says if you hover your mouse over, it'll automatically enter this."
  },
  {
    "start": 262.85999999999996,
    "text": " And what it does is you just let it sit there and it grabs the spectra and shows you where everything's peaking."
  },
  {
    "start": 272.85999999999996,
    "text": " And then if you want, you can go in and basically grab a node and reduce some of that resonance."
  },
  {
    "start": 284.94,
    "text": " And then each node generates its own little floating thing here where you have your own EQ control."
  },
  {
    "start": 297.94,
    "text": " You can change what it is. So you've got all these things. You can turn it on and off."
  },
  {
    "start": 309.02,
    "text": " And you can also do a lot of the stuff here. So you can turn it back on. You can solo it."
  },
  {
    "start": 320.02,
    "text": " Pretty cool. And then you can change basically the shape."
  },
  {
    "start": 326.09999999999997,
    "text": " Now, one thing I like about Pro-Q3 is it has EQ capabilities that EQ doesn't come with."
  },
  {
    "start": 340.09999999999997,
    "text": " So for example, this is one I've been using a lot since I got it. Basically, it is like a tilt."
  },
  {
    "start": 350.18,
    "text": " So you can adjust the frequency balance of a track or a group of tracks using this tilt control, which is pretty powerful."
  },
  {
    "start": 364.18,
    "text": " Sometimes you just want to reduce a little bit of the bass, but you don't want to impact the mix too much."
  },
  {
    "start": 371.18,
    "text": " You can just kind of toss it in there. It's pretty nice."
  },
  {
    "start": 375.26,
    "text": " And then the cool thing is that you have two pieces of information that you're grabbing all the time with this."
  },
  {
    "start": 390.26,
    "text": " First is you have your standard spectra, right?"
  },
  {
    "start": 398.34,
    "text": " But then once you start applying EQ, you get the ghost, basically."
  },
  {
    "start": 405.34,
    "text": " So you see where it was before in the background, and then you see what your EQ is actually doing to the signal."
  },
  {
    "start": 414.34,
    "text": " So it gives you a lot of visual information to work with."
  },
  {
    "start": 420.34,
    "text": " And I find that a pretty compelling feature because, you know, yeah, of course, you should be using your ears when you're mixing."
  },
  {
    "start": 426.41999999999996,
    "text": " But sometimes your ears are only so powerful in terms of understanding what the work is that you're doing, especially in the low end."
  },
  {
    "start": 433.41999999999996,
    "text": " Like, I know a lot of us don't have the most accurate bass referencing available to us, right?"
  },
  {
    "start": 442.41999999999996,
    "text": " So when you're looking at bass frequencies, you know, it's useful to see what's going on when you're messing with EQ"
  },
  {
    "start": 451.5,
    "text": " and what three decibels actually impacts, you know?"
  },
  {
    "start": 467.5,
    "text": " There's a lot more to this EQ. There's like a multi-band or like a dynamic EQ function here as well that I haven't really messed with that much."
  },
  {
    "start": 476.58,
    "text": " But so far I'm finding that just these features that I've outlined already have sold me on this 100%."
  },
  {
    "start": 487.58,
    "text": " Now, another thing that's really interesting about this is that you can have multiple instances of Pro-Q3 across your mix."
  },
  {
    "start": 497.58,
    "text": " So say you have one of them on your drums, one of them on your bass, one of them on your guitar, or you have two guitars."
  },
  {
    "start": 504.65999999999997,
    "text": " Then what you can do is use this thing called Show Collisions."
  },
  {
    "start": 513.66,
    "text": " And Show Collisions basically, you toggle it on and it will show you if you have frequencies that are colliding with one another in your mix."
  },
  {
    "start": 523.66,
    "text": " That could potentially be causing masking. Obviously this isn't like a replacement for listening to your mix."
  },
  {
    "start": 532.74,
    "text": " But if you're importing a track with say like 150 different instruments, or you're just starting out on a mix,"
  },
  {
    "start": 541.74,
    "text": " you can toss the Pro-Q3 on to a bunch of different instances or groups and then you can see what's going on pretty quickly."
  },
  {
    "start": 549.74,
    "text": " See if there's buildup and just go quickly tackle that first, right?"
  },
  {
    "start": 552.74,
    "text": " So I think these are just some really smart features that are the reason why pros are using this."
  },
  {
    "start": 560.82,
    "text": " So with that, I'm going to end this little comparison video."
  },
  {
    "start": 565.82,
    "text": " If you like what I'm doing, please subscribe to my channel."
  },
  {
    "start": 570.82,
    "text": " Check out some of my other stuff. Give me a like."
  },
  {
    "start": 573.82,
    "text": " Share this with your friends. Your friends are into producing."
  },
  {
    "start": 576.82,
    "text": " And yeah, thanks so much. Peace."
  }
]