[
  {
    "start": 0.0,
    "text": " We were talking about earlier at the beginning of the session was something called global"
  },
  {
    "start": 4.8,
    "text": " quantization."
  },
  {
    "start": 5.8,
    "text": " And now let's point this out and talk a little bit further about exactly what this powerful"
  },
  {
    "start": 10.200000000000001,
    "text": " feature does inside SessionView."
  },
  {
    "start": 12.9,
    "text": " So global quantization, which is right here, has a drop down menu."
  },
  {
    "start": 17.52,
    "text": " I can look at a number of values here."
  },
  {
    "start": 20.68,
    "text": " The default is one bar."
  },
  {
    "start": 22.580000000000002,
    "text": " And all this means is that whenever I'm clicking something or asking something to launch inside"
  },
  {
    "start": 28.8,
    "text": " SessionView, it's going to follow whatever I have in this drop down menu."
  },
  {
    "start": 33.800000000000004,
    "text": " And it's one of these things that really sets Ableton apart and changes your workflow and"
  },
  {
    "start": 41.64,
    "text": " your engagement in your tracks."
  },
  {
    "start": 43.92,
    "text": " It's the kind of thing where I can take somebody else's track or my own track and start performing"
  },
  {
    "start": 48.92,
    "text": " live with it."
  },
  {
    "start": 50.2,
    "text": " Or what I can do is even in my own tracks, it brings out more of a kind of a performance"
  },
  {
    "start": 56.64,
    "text": " in the studio."
  },
  {
    "start": 57.94,
    "text": " So let's dive in a bit deeper into global quantization and take a look at some of its"
  },
  {
    "start": 61.5,
    "text": " functions."
  },
  {
    "start": 63.339999999999996,
    "text": " So we have our drop down menu here."
  },
  {
    "start": 65.14,
    "text": " Again, we notice that the default was set to one bar."
  },
  {
    "start": 68.74,
    "text": " Now we can play with that or we can do a smaller increment or denomination here like an eighth"
  },
  {
    "start": 76.53999999999999,
    "text": " note."
  },
  {
    "start": 77.7,
    "text": " And what this does is it just enables me to launch things quicker."
  },
  {
    "start": 83.02,
    "text": " And let's just trigger a few things on the fly and see what happens."
  },
  {
    "start": 86.18,
    "text": " And let's see exactly what we can do to make this piece a little bit different from the"
  },
  {
    "start": 90.82000000000001,
    "text": " original."
  },
  {
    "start": 116.18,
    "text": " I can go and stop each clip individually if I want to as well."
  }
]