[
  {
    "start": 0.0,
    "text": " What is up YouTube? Today I'm going to show you some secret settings in ping-pong."
  },
  {
    "start": 8.24,
    "text": " I'm pretty sure I went over one of them to do a little tape stop thing but I"
  },
  {
    "start": 15.280000000000001,
    "text": " want to go over all of them so you understand. So first things first is just"
  },
  {
    "start": 21.8,
    "text": " the basic ping-pong."
  },
  {
    "start": 24.8,
    "text": " It has that delay. We'll turn the feedback down a little bit. So if you"
  },
  {
    "start": 33.92,
    "text": " right click the top it has repitch and jump. So we'll do the repitch and you're"
  },
  {
    "start": 39.08,
    "text": " going to want to turn the time on. Maybe we will go like..."
  },
  {
    "start": 42.6,
    "text": " And as you pull the time down it gets higher and higher and if you want to..."
  },
  {
    "start": 72.6,
    "text": " And obviously you can control the frequencies up there and then the last one jump."
  },
  {
    "start": 102.6,
    "text": " It's just a little different setting but my favorite is obviously just the"
  },
  {
    "start": 116.83999999999999,
    "text": " normal fade and then that's going to give you that normal ping-pong delay."
  },
  {
    "start": 120.6,
    "text": " Then the repitch to do like that tape stop stuff where you pull that the time"
  },
  {
    "start": 125.75999999999999,
    "text": " down. Pull it down and put it up to get a higher pitch or lower pitch and one"
  },
  {
    "start": 131.08,
    "text": " done correctly. You can automate it, do like a tape stop, bounce it out and then"
  },
  {
    "start": 135.4,
    "text": " kind of clean it up so it doesn't have the tails and stuff and you have a nice"
  },
  {
    "start": 138.84,
    "text": " tape stop effect. But those are the secret settings in ping-pong. You"
  },
  {
    "start": 143.8,
    "text": " either know they're there or you don't know they're there and now because you"
  },
  {
    "start": 147.88000000000002,
    "text": " watch this you know they're there. And a lot of stuff in Ableton has a few"
  },
  {
    "start": 152.32,
    "text": " settings. I'm pretty sure reverb too. No it was right here. The quality you can"
  },
  {
    "start": 161.51999999999998,
    "text": " put it in high quality, eco or mid quality. So definitely go high if you"
  },
  {
    "start": 166.6,
    "text": " can do it. Eco if you can't you need some CPU space. Do it on eco. I know"
  },
  {
    "start": 174.35999999999999,
    "text": " Massive has another eco setting or high quality setting and yeah there's just a"
  },
  {
    "start": 179.56,
    "text": " lot of secret little settings here and there that if you don't know just right"
  },
  {
    "start": 185.08,
    "text": " click them all and see what it says you know and just go through them. EQ has"
  },
  {
    "start": 191.8,
    "text": " oversampling and it also has the modes over here the stereo left and right and"
  },
  {
    "start": 197.68,
    "text": " mid and sides. So that's something for you to experiment with. The ping-pong"
  },
  {
    "start": 202.16,
    "text": " delay one is super fun to mess with and resample and make new sounds. As always I"
  },
  {
    "start": 207.52,
    "text": " hope you subscribe. If you haven't subscribed already drop us a thumbs up."
  },
  {
    "start": 211.16000000000003,
    "text": " Help us out and thanks for watching. Peace."
  }
]