[
  {
    "start": 0.0,
    "text": " Hey guys, it's Will from EDM Tips and today I want to create a melodic techno track from scratch."
  },
  {
    "start": 5.68,
    "text": " I'm going to be using ArtBat as the inspiration and I want to show you every step of the process"
  },
  {
    "start": 9.96,
    "text": " going from a completely blank door project all the way through the chord creation, the drums, the synths, the bass,"
  },
  {
    "start": 15.96,
    "text": " everything you need to get that really nice melodic techno sound."
  },
  {
    "start": 19.68,
    "text": " And this is what we're going to be creating today."
  },
  {
    "start": 22.44,
    "text": " Mate, that's epic!"
  },
  {
    "start": 26.560000000000002,
    "text": " Yes! Come on!"
  },
  {
    "start": 30.48,
    "text": " As usual, you can download this project file, all the samples completely free below this video."
  },
  {
    "start": 34.72,
    "text": " Okay, so without further ado, let's hop into the door and get it done."
  },
  {
    "start": 38.16,
    "text": " So I've opened up this blank project, obviously."
  },
  {
    "start": 40.72,
    "text": " First thing I'm going to do is select a melodic techno tempo, so about 124 bpm."
  },
  {
    "start": 46.4,
    "text": " I'm going to save this. It's going to be based on ArtBat, so what I'm going to call this is"
  },
  {
    "start": 51.68,
    "text": " You Must Be Batty Son."
  },
  {
    "start": 54.8,
    "text": " Okay, and next thing we want to do is create the chords."
  },
  {
    "start": 57.52,
    "text": " I've got my magic list, but to do that we need to know what vibe we're going for."
  },
  {
    "start": 61.2,
    "text": " So if we listen to someone like ArtBat, their music is dark and hypnotic,"
  },
  {
    "start": 65.36,
    "text": " but there are these beautiful sparse melodies as well."
  },
  {
    "start": 68.24000000000001,
    "text": " Anything too complicated is going to detract from that techno vibe."
  },
  {
    "start": 71.68,
    "text": " And then we've got these lovely chords in the breaks as well."
  },
  {
    "start": 74.72,
    "text": " So we've got this kind of juxtaposition between the hypnotic techno beat"
  },
  {
    "start": 78.72,
    "text": " and then we've got these lovely heart-melting chords in the break."
  },
  {
    "start": 82.0,
    "text": " So the first thing I'm going to do is decide on a scale in which to write this."
  },
  {
    "start": 85.52,
    "text": " Now if you're using a modern DAW, which we all are, let's be honest,"
  },
  {
    "start": 88.72,
    "text": " you've got these lovely controls now where you can just press a scale button"
  },
  {
    "start": 92.88,
    "text": " and it's going to just hide all of the notes that aren't in that scale,"
  },
  {
    "start": 96.08,
    "text": " meaning that you're never really going to hit a wrong note."
  },
  {
    "start": 98.39999999999999,
    "text": " So I'm going to do this in just randomly. I'm going to choose F minor."
  },
  {
    "start": 102.47999999999999,
    "text": " Most techno would be in a minor key and it gives it that slightly dark feel."
  },
  {
    "start": 106.47999999999999,
    "text": " So let's just work out these chords. I'm going to colour these blue"
  },
  {
    "start": 110.16,
    "text": " and I'm going to work it out in piano because that's going to stop"
  },
  {
    "start": 114.08,
    "text": " any distraction from sound design or anything like that."
  },
  {
    "start": 116.8,
    "text": " So if we press this scale button here in Ableton,"
  },
  {
    "start": 119.36,
    "text": " but it's similar in Logic or FL Studio, only the notes from within this scale are going to show."
  },
  {
    "start": 124.56,
    "text": " Let's get a simple grand piano sound on there and work out the bass notes first"
  },
  {
    "start": 129.68,
    "text": " and then we can build those chords from those bass notes."
  },
  {
    "start": 132.64,
    "text": " Now this is just going to be in the break but we're going to use the root note from this"
  },
  {
    "start": 136.0,
    "text": " for the hypnotic techno part as well. So let's just listen to some of these notes."
  },
  {
    "start": 140.24,
    "text": " I think I might start from the root note just to keep things easy."
  },
  {
    "start": 144.8,
    "text": " And we'll just make four chords."
  },
  {
    "start": 151.60000000000002,
    "text": " Let's make them twice as long actually because we want this lovely soaring techno break."
  },
  {
    "start": 163.68,
    "text": " So these will be our bass notes. Let's drop them down an octave."
  },
  {
    "start": 166.4,
    "text": " And now let's build up the chords from these bass notes."
  },
  {
    "start": 169.04000000000002,
    "text": " Now the easiest thing to do if you are in scale mode is just skip a note each time."
  },
  {
    "start": 173.76,
    "text": " We can tweak things after that but it's a good place to start."
  },
  {
    "start": 177.51999999999998,
    "text": " I'm just adding the third and the fifth above each root note."
  },
  {
    "start": 182.32,
    "text": " And then I'm going to add some sevenths as well to give it a really nice heart-melting feel."
  },
  {
    "start": 188.64,
    "text": " Apart from the last one because this would be a diminished..."
  },
  {
    "start": 192.95999999999998,
    "text": " Actually, you know that sounds good. It's not diminished. Forget I said that."
  },
  {
    "start": 204.48,
    "text": " Ah, lush. What I'm going to do is a couple of chord inversions as well."
  },
  {
    "start": 211.28,
    "text": " And that just means dropping a couple of these notes or raising them by an octave."
  },
  {
    "start": 215.28,
    "text": " So they're the same note but played within a smaller range."
  },
  {
    "start": 219.84,
    "text": " And that's just going to make it sound really nice."
  },
  {
    "start": 224.79999999999998,
    "text": " So now let's listen to them."
  },
  {
    "start": 233.76,
    "text": " So nice. And we're going to pick a really nice preset for those very shortly."
  },
  {
    "start": 242.23999999999998,
    "text": " So now we've created our break chords. We can go back to the main drop of the track"
  },
  {
    "start": 246.72,
    "text": " which is going to be that hypnotic techno rhythm."
  },
  {
    "start": 249.35999999999999,
    "text": " So all we need to do... Let's move these over."
  },
  {
    "start": 251.84,
    "text": " We're just going to use the root note of the track which is the F because this is F minor."
  },
  {
    "start": 256.32,
    "text": " So let's just create a bass line. It's going to be on every 16th..."
  },
  {
    "start": 260.15999999999997,
    "text": " ...like that to give it that really driving feel."
  },
  {
    "start": 264.24,
    "text": " So I'm going to use just the plugins from Ableton Live today."
  },
  {
    "start": 267.76,
    "text": " I'm going to get the wave table."
  },
  {
    "start": 270.48,
    "text": " And firstly, I'm just going to program the bass and it's just going to be hitting that root note."
  },
  {
    "start": 277.92,
    "text": " But I'm going to bounce up an octave."
  },
  {
    "start": 280.8,
    "text": " So if we just copy loads of Fs on the 16th..."
  },
  {
    "start": 285.36,
    "text": " ...and then we're going to put one of them up an octave every couple of notes."
  },
  {
    "start": 298.96000000000004,
    "text": " And that's going to create a really nice repetitive hypnotic rhythm."
  },
  {
    "start": 303.44,
    "text": " So let's just delete these and duplicate this first part."
  },
  {
    "start": 306.48,
    "text": " All right, so let's create this sound that we want."
  },
  {
    "start": 308.48,
    "text": " Most of the synths in ArtBats tunes are based on a saw wave and it's actually much easier to create"
  },
  {
    "start": 314.48,
    "text": " most sounds than you might think."
  },
  {
    "start": 315.84000000000003,
    "text": " And you can click on the video that's popping up now for my sound design framework."
  },
  {
    "start": 319.6,
    "text": " But let's just tweak the envelope of this and make it really a plucky sound."
  },
  {
    "start": 323.84000000000003,
    "text": " We're going to switch this to mono because we don't want the bass notes bleeding over each other."
  },
  {
    "start": 327.84,
    "text": " Okay, now we need to add a filter envelope."
  },
  {
    "start": 330.23999999999995,
    "text": " So I'll take the filter down."
  },
  {
    "start": 333.35999999999996,
    "text": " And we're going to assign this to the same envelope and that's just going to give us some more pluckiness."
  },
  {
    "start": 344.47999999999996,
    "text": " What I'm going to do is I'm going to add a filter envelope."
  },
  {
    "start": 347.28,
    "text": " So I'm going to add a filter envelope."
  },
  {
    "start": 349.28,
    "text": " And I'm going to assign this to the same envelope."
  },
  {
    "start": 351.28,
    "text": " And that's just going to give us some more pluckiness."
  },
  {
    "start": 357.84,
    "text": " What I'm also going to do is create a key mapping using this MIDI control."
  },
  {
    "start": 364.0,
    "text": " So the higher the note is, the more that filter opens up."
  },
  {
    "start": 367.35999999999996,
    "text": " It's going to be very subtle because these notes are only one octave apart."
  },
  {
    "start": 370.47999999999996,
    "text": " But basically it means that if you play a lower down note on the keyboard,"
  },
  {
    "start": 375.44,
    "text": " the filter is going to be closed off."
  },
  {
    "start": 377.03999999999996,
    "text": " And if you pay one right up at the top, the filter is going to be opened up."
  },
  {
    "start": 380.71999999999997,
    "text": " So I'm just going to add a little bit of that effect."
  },
  {
    "start": 388.4,
    "text": " Okay, let's add a sub line to this."
  },
  {
    "start": 393.91999999999996,
    "text": " Add some low end weight."
  },
  {
    "start": 401.35999999999996,
    "text": " We're pretty much there."
  },
  {
    "start": 403.35999999999996,
    "text": " Now what I want to do is just take out the clickiness because that's the trouble with some of these plugins."
  },
  {
    "start": 409.35999999999996,
    "text": " They're going to be creating click even if the filter is closed down."
  },
  {
    "start": 414.08,
    "text": " So I'm just going to take out the high end click."
  },
  {
    "start": 418.0,
    "text": " So it's a smoother sound."
  },
  {
    "start": 424.4,
    "text": " And now let's add a bit of interest to that bassline by adding some delay."
  },
  {
    "start": 427.91999999999996,
    "text": " So I've got this bass reverb auxiliary channel I've already set up,"
  },
  {
    "start": 431.12,
    "text": " but I'm just going to delete the reverb and then put a delay on there instead."
  },
  {
    "start": 437.28,
    "text": " Simple delay will do nicely."
  },
  {
    "start": 439.35999999999996,
    "text": " 100% wet."
  },
  {
    "start": 441.52,
    "text": " And we are going to have a very short feedback and ping pong,"
  },
  {
    "start": 444.96,
    "text": " and that's going to help our bassline bounce side to side."
  },
  {
    "start": 447.84,
    "text": " So let's just feed some of this bass into that."
  },
  {
    "start": 455.11999999999995,
    "text": " So we can instantly hear we've got some interesting bass going on."
  },
  {
    "start": 459.84,
    "text": " And I've got an EQ after the bass, sorry, after the delay."
  },
  {
    "start": 464.0,
    "text": " Just take out the low end so we don't run into phase cancellation issues."
  },
  {
    "start": 467.35999999999996,
    "text": " Now let's add the kick underneath this."
  },
  {
    "start": 469.2,
    "text": " Really nice and simple."
  },
  {
    "start": 470.15999999999997,
    "text": " Get a strong kick and then we're going to go boom, boom, boom, boom."
  },
  {
    "start": 473.35999999999996,
    "text": " I want you in my room."
  },
  {
    "start": 474.4,
    "text": " So we're going to go to wheel favorites, kicks."
  },
  {
    "start": 480.15999999999997,
    "text": " There we go."
  },
  {
    "start": 480.71999999999997,
    "text": " Let's throw that on."
  },
  {
    "start": 482.96,
    "text": " Program it in so that each kick is only half a beat long."
  },
  {
    "start": 487.84,
    "text": " We don't want a really long kick tail."
  },
  {
    "start": 490.47999999999996,
    "text": " We might even be able to make these kicks shorter and just have the transient"
  },
  {
    "start": 493.59999999999997,
    "text": " because we've got this lovely low end bass."
  },
  {
    "start": 496.08,
    "text": " So that's pretty much the techno groove already, but we need to fatten this up and get it really"
  },
  {
    "start": 500.4,
    "text": " pounding. So first thing I'm going to try and tune the kick to the key of the track just to see if"
  },
  {
    "start": 505.35999999999996,
    "text": " it sounds any better. It might not, but it might just gel things together and get that low end"
  },
  {
    "start": 509.59999999999997,
    "text": " weight even more. So I'm going to take it up to a higher octave so I can actually hear the note that"
  },
  {
    "start": 514.16,
    "text": " the kick is hitting."
  },
  {
    "start": 527.0400000000001,
    "text": " And I'm going to tune it to the bass."
  },
  {
    "start": 534.48,
    "text": " I think that's about right."
  },
  {
    "start": 536.08,
    "text": " Plus 46. So now I need to take that kick back down in steps of an octave each time to get as close"
  },
  {
    "start": 541.76,
    "text": " to zero as possible. I'm just going to hold shift and press down. That's going to drop this by 12"
  },
  {
    "start": 547.5200000000001,
    "text": " semitones each time. There we go. So minus two. This is now tuned to the track, but in the correct"
  },
  {
    "start": 554.96,
    "text": " octave for the kick. And now let's see how it sounded before and see if it's any better."
  },
  {
    "start": 569.2,
    "text": " I think the kick tuned to the track sounds really good in this situation, so I'm going to keep that."
  },
  {
    "start": 573.6,
    "text": " Now we are going to get the kick and the bass grouped together into a bus. And this is so we"
  },
  {
    "start": 579.44,
    "text": " can gel them together and get them sounding really nice and thick and rich. So the way I'm going to"
  },
  {
    "start": 583.76,
    "text": " do that is add a bit of saturation with the drum bus that comes with Ableton. And this is also going"
  },
  {
    "start": 589.52,
    "text": " to add some compression. And I'm just going to use the dry and wet control just to get to a sweet spot."
  },
  {
    "start": 600.4,
    "text": " Add some boom. Now we can tune this to the correct key. So that would be an F."
  },
  {
    "start": 608.24,
    "text": " And let's add some low end harmonics."
  },
  {
    "start": 614.72,
    "text": " Oh, that is heavy, mate. So that's with the drum bus off and this is with it on."
  },
  {
    "start": 623.04,
    "text": " Heavy, heavy blood. Okay, next thing we are going to do is create the synth riff. We've got the"
  },
  {
    "start": 628.64,
    "text": " chords. We're going to get back to those in a few minutes, but let's create now a synth riff"
  },
  {
    "start": 634.16,
    "text": " that is going to give that real interest to the track. We're going to create two in total."
  },
  {
    "start": 640.64,
    "text": " Synth riff one and synth riff two. And they're both going to be cyan because that's the natural"
  },
  {
    "start": 646.3199999999999,
    "text": " color of synths in nature. That's actually the truth as well. If you go into the African"
  },
  {
    "start": 651.12,
    "text": " veld and see synths running around, they will be cyan in color if the light catches them right."
  },
  {
    "start": 656.4,
    "text": " So we are going to stick a wavetable on each of those. And we are going to create... Sometimes"
  },
  {
    "start": 664.4,
    "text": " I talk such nonsense. Don't blame me, blame my upbringing. Okay, riff one. Here we go. Again,"
  },
  {
    "start": 670.88,
    "text": " we are going to be working within the same scale, of course. We're going to pick F minor"
  },
  {
    "start": 677.4399999999999,
    "text": " and then hit the scale button and all these notes are going to be within the scale."
  },
  {
    "start": 681.76,
    "text": " So first thing I want to do is actually just create some interesting riff that just brings"
  },
  {
    "start": 686.24,
    "text": " this to life. And what I'm going to be doing is using the sixteenths just before or after each"
  },
  {
    "start": 692.4,
    "text": " beat. And that's going to make the groove and the syncopation really come to life in this track."
  },
  {
    "start": 696.64,
    "text": " I'm going to specifically try and use the root note, the third, the fifth, the seventh,"
  },
  {
    "start": 702.16,
    "text": " and that's going to make a nice strong melody because that's really what this riff is going to be."
  },
  {
    "start": 716.64,
    "text": " Can you see? I'm using the sixteenth interval just before the beat on the grid and that gives"
  },
  {
    "start": 721.68,
    "text": " it that syncopated feel. So let's just duplicate that and we're just going to change the notes"
  },
  {
    "start": 733.1999999999999,
    "text": " each time. Repetition is important. Cool. So that's actually a really nice sounding riff."
  },
  {
    "start": 749.76,
    "text": " Now we are going to use two oscillators in this. So I'm going to open up the wave table"
  },
  {
    "start": 753.84,
    "text": " and I want to create a slightly more hollow sound. So for that I'm going to go for a triangle wave"
  },
  {
    "start": 759.12,
    "text": " layered up with this saw wave. So let's add a saw wave. Let's turn it down a bit though"
  },
  {
    "start": 769.4399999999999,
    "text": " and add this triangle wave"
  },
  {
    "start": 773.52,
    "text": " and balance the levels."
  },
  {
    "start": 779.76,
    "text": " That's a nice sound. Okay, I'm going to close this down again and we're going to add a bit of a filter"
  },
  {
    "start": 795.52,
    "text": " and tweak to make it more of a pluck. Really short sustain."
  },
  {
    "start": 802.64,
    "text": " Take down the filter and again we're going to assign this envelope to the filter cutoff as"
  },
  {
    "start": 809.52,
    "text": " well. Same as we did with the bass line. Very similar sounds in the way they're created."
  },
  {
    "start": 822.0799999999999,
    "text": " Now the beauty here is when we create the interest by using delay and reverb on the auxiliary channel"
  },
  {
    "start": 828.56,
    "text": " to create a really nice interesting sound. Because what people will often do is over complicate their"
  },
  {
    "start": 833.92,
    "text": " tracks. Especially when it comes to techno. When we want to keep things simple and have just a few"
  },
  {
    "start": 839.12,
    "text": " sounds but then process them really well to create the interest. So let's call this synth"
  },
  {
    "start": 844.16,
    "text": " or let's call this riff one effect. Okay, now we've got this auxiliary channel. I want to add a delay"
  },
  {
    "start": 853.76,
    "text": " and I want to create an interesting triplet effect. So 100% wet because it's on an auxiliary channel."
  },
  {
    "start": 860.64,
    "text": " We don't want the dry signal doubled up and let's feed some of this synth riff into that channel."
  },
  {
    "start": 869.44,
    "text": " Okay, now I'm going to detach these two from each other and let's just make them slightly different"
  },
  {
    "start": 880.0,
    "text": " and that's going to create stereo width. Because the delayed signal on the left and the right are"
  },
  {
    "start": 884.64,
    "text": " going to be slightly different. Take out some of the low end. So that's already creating really"
  },
  {
    "start": 896.8,
    "text": " interesting stereo feel. Now what I'm going to do is add a second delay after that and we're just"
  },
  {
    "start": 902.4,
    "text": " going to add multiple delays basically. We'll put ping pong on. We're just going to have this one"
  },
  {
    "start": 909.04,
    "text": " synced and just try and feed in till we get some interesting rhythm with that."
  },
  {
    "start": 918.7199999999999,
    "text": " So it's almost like crystallized and fractured. It's frac-fract and then I'm going to add a"
  },
  {
    "start": 926.64,
    "text": " hybrid reverb on there as well just to smooth out that delay because it's got some really"
  },
  {
    "start": 931.36,
    "text": " interesting presets in this. So let's go to hybrid reverb, special and let's choose echo flex."
  },
  {
    "start": 943.1999999999999,
    "text": " Yeah, so now we're getting that vibe. The last thing I'm going to do and this is a bit advanced"
  },
  {
    "start": 948.24,
    "text": " and we cover this in the accelerator program as well as way more. But I'm going to side chain the"
  },
  {
    "start": 954.72,
    "text": " reverb from the dry signal. So we go synth riff and I'm just going to duck the delayed signal by"
  },
  {
    "start": 964.08,
    "text": " the dry signal so it can breathe, breathe through. And it almost sounds like it's reversing the delay."
  },
  {
    "start": 978.0,
    "text": " Excellent. Okay, what's next on my magic riff? The second synth riff. So again, I'm going to just"
  },
  {
    "start": 982.88,
    "text": " chuck in a wavetable already there. We're going to get a bit of a plucky sound and I don't have"
  },
  {
    "start": 988.0799999999999,
    "text": " my keyboard plugged in. Let's plug it in. Preparation is key guys. Let's have a sip of coffee,"
  },
  {
    "start": 993.1999999999999,
    "text": " shall we? In this amazing mug. Wow. Nice. Tastes better and better every time on that mug. Right,"
  },
  {
    "start": 1001.4399999999999,
    "text": " let's create a second riff and this is going to be like a counter melody. They won't necessarily"
  },
  {
    "start": 1008.56,
    "text": " play at the same time and how we arrange this track is going to be all important."
  },
  {
    "start": 1013.5999999999999,
    "text": " I'm going to base this on a saw wave as well, unsurprisingly."
  },
  {
    "start": 1029.9199999999998,
    "text": " So I'm actually just dropping this each time. So it's following a particular pattern and"
  },
  {
    "start": 1039.12,
    "text": " I don't like that last one though."
  },
  {
    "start": 1057.84,
    "text": " That's kind of cool. I might tweak that later and the next thing I'm going to do is just add"
  },
  {
    "start": 1061.6799999999998,
    "text": " a specific delay to that as well and I'm doing it on the octave. So I'm going to add a little"
  },
  {
    "start": 1068.24,
    "text": " auxiliary channels just because you've got more control as you've seen. We can EQ the signal,"
  },
  {
    "start": 1073.36,
    "text": " we can sidechain duck it. There's a lot more you can do if you use auxiliary channels. So I'm just"
  },
  {
    "start": 1078.48,
    "text": " going to use a much later, a standard delay on this as well I think and this is going to be a"
  },
  {
    "start": 1083.6,
    "text": " simple delay just to add some interest."
  },
  {
    "start": 1102.8,
    "text": " Cool, okay now we are on to creating the drums. So we've got the chords which we're going to get"
  },
  {
    "start": 1108.08,
    "text": " to very shortly when we come to arrangement but we've got the main groove of the track."
  },
  {
    "start": 1118.72,
    "text": " Now I'm going to turn off these synth riffs to create the drums and what I'm going to do is just"
  },
  {
    "start": 1123.36,
    "text": " use some simple techno style drums. So I think I'm going to go for a 808 closed hat for the main"
  },
  {
    "start": 1134.48,
    "text": " 16th groove and I'm just going to tweak the velocity of a couple of them just to"
  },
  {
    "start": 1143.2800000000002,
    "text": " give a little bit of movement and interest as each one is a slightly different volume"
  },
  {
    "start": 1148.5600000000002,
    "text": " and let's just play that."
  },
  {
    "start": 1158.0,
    "text": " I might double that up and layer it with something else just to bring some more"
  },
  {
    "start": 1163.04,
    "text": " high end."
  },
  {
    "start": 1168.32,
    "text": " This I think and let's just double that up but very gently bring that in."
  },
  {
    "start": 1180.8799999999999,
    "text": " Compound them slightly left and right add some stereo whip."
  },
  {
    "start": 1184.64,
    "text": " Excellent, okay next thing we're going to do is add the open hat but instead of an actual open hat"
  },
  {
    "start": 1194.0,
    "text": " I think I'll use a shaker. So I want to keep this really nice and tight you know we want this really"
  },
  {
    "start": 1199.0400000000002,
    "text": " nice tight techno sound. I could probably experiment with finding the right sound for the job that's"
  },
  {
    "start": 1211.4399999999998,
    "text": " going to fit in with all the other sounds. So what I will do is when it's programmed in just"
  },
  {
    "start": 1215.6799999999998,
    "text": " in between each kick make sure it's nice and quiet. Whoops that's the incorrect place."
  },
  {
    "start": 1223.1999999999998,
    "text": " Taxi! There we go in between each kick. Try again."
  },
  {
    "start": 1235.04,
    "text": " It's just subtle"
  },
  {
    "start": 1235.84,
    "text": " and we could scroll through a couple of sounds."
  },
  {
    "start": 1246.56,
    "text": " Find one that just sits with everything else nicely."
  },
  {
    "start": 1250.3999999999999,
    "text": " I quite like that. Okay now let's find a clap. Now again I want something really short and"
  },
  {
    "start": 1255.9199999999998,
    "text": " crisp nothing over the top here because it's that's the vibe of the track right."
  },
  {
    "start": 1266.0,
    "text": " So"
  },
  {
    "start": 1279.28,
    "text": " this one I think I will use but I'm going to take out this pre-transient so we've just got the little"
  },
  {
    "start": 1283.76,
    "text": " clap there. Let's program that in on every other kick like a house beat and let's have a listen to"
  },
  {
    "start": 1292.8,
    "text": " it. Just bring it in really slowly and quietly"
  },
  {
    "start": 1302.56,
    "text": " in mono which helps helps us balance the levels more easily and the mono"
  },
  {
    "start": 1310.08,
    "text": " switch is just a utility plugin on the master channel with a keyboard shortcut to switch on"
  },
  {
    "start": 1314.88,
    "text": " the mono switch."
  },
  {
    "start": 1336.88,
    "text": " I'm going to add one more clap I think with a bit more high end so I've got two layers of clap."
  },
  {
    "start": 1343.1200000000001,
    "text": " So let's go to our claps again."
  },
  {
    "start": 1351.6,
    "text": " That's got some nice high end. So let's just layer that up with the original clap double it up"
  },
  {
    "start": 1358.88,
    "text": " and just bring it in quietly and we're just going to have the top end of this."
  },
  {
    "start": 1366.64,
    "text": " Let's reduce the length."
  },
  {
    "start": 1372.96,
    "text": " And I'm going to filter out the low end."
  },
  {
    "start": 1380.72,
    "text": " So we've just got this bit."
  },
  {
    "start": 1390.8,
    "text": " Okay that's our main groove so now let's get onto the arrangement and this lovely break as well."
  },
  {
    "start": 1402.72,
    "text": " But first I need you to let me know if you're enjoying this so far give me a hell yeah"
  },
  {
    "start": 1407.36,
    "text": " or an amen brother if you're feeling holy and let me know in the comments what style of music do"
  },
  {
    "start": 1413.12,
    "text": " you want to see me cover on this channel. Is there anything in particular you're struggling with that"
  },
  {
    "start": 1416.88,
    "text": " I can help you with? Okay without further ado let's continue. Okay so for these chords I'm"
  },
  {
    "start": 1422.0,
    "text": " actually going to completely not use this piano. I'm going to create a synth from scratch and I'm"
  },
  {
    "start": 1426.8000000000002,
    "text": " just going to create a custom pad. So I'll go to a saw wave as usual take down the filter so it's"
  },
  {
    "start": 1433.92,
    "text": " a bit more muted and now we need to tweak the ADSR controls to get it into the shape of a pad."
  },
  {
    "start": 1443.12,
    "text": " So that would be a full sustain, a fairly long attack and a fairly long release."
  },
  {
    "start": 1457.84,
    "text": " So they blur into each other."
  },
  {
    "start": 1462.2399999999998,
    "text": " And now let's add some unison."
  },
  {
    "start": 1463.68,
    "text": " Which just makes it really nice and lush and thick."
  },
  {
    "start": 1479.1200000000001,
    "text": " I'm also going to add an LFO. Now let's open up the wavetable and see if we can do something"
  },
  {
    "start": 1483.68,
    "text": " interesting. If we get a second oscillator with some random oscillator waveform let's"
  },
  {
    "start": 1492.88,
    "text": " hear what it sounds like on its own. Oh that's nice. So I want to create some movement here."
  },
  {
    "start": 1500.96,
    "text": " So I'm going to use one of these LFOs like this. Make it a bit slower and I'm going to assign this"
  },
  {
    "start": 1507.1200000000001,
    "text": " to the wavetable position I think. So let's just make this get this moving a bit."
  },
  {
    "start": 1523.44,
    "text": " Okay I'm not sure I like that."
  },
  {
    "start": 1532.5600000000002,
    "text": " We want to take it off re-trigger so that when every note hits it doesn't start the LFO cycle"
  },
  {
    "start": 1538.0800000000002,
    "text": " from the beginning."
  },
  {
    "start": 1541.28,
    "text": " And we want to be able to warp this as well. So if we go to"
  },
  {
    "start": 1552.08,
    "text": " classic or no modern we can adjust this fold or this warp like so"
  },
  {
    "start": 1558.8,
    "text": " with the same LFO and that's just going to create more movement."
  },
  {
    "start": 1568.32,
    "text": " Like so."
  },
  {
    "start": 1572.0,
    "text": " Very subtle. Just adding movement and then with our other wave and we're taking out the low end"
  },
  {
    "start": 1580.0,
    "text": " as well with a high pass filter. Lovely. Just a really lush rich pad. Next thing we're going to"
  },
  {
    "start": 1588.8,
    "text": " do is create a bass for this break. So I'm just going to create another bass line here and"
  },
  {
    "start": 1594.0,
    "text": " unsurprisingly call it break bass original and color it yellow. The natural color of bass,"
  },
  {
    "start": 1599.68,
    "text": " a highly contested topic, but nevertheless I maintain my correctness. Let's call this break"
  },
  {
    "start": 1604.88,
    "text": " bass and we want to create a nice smooth re-space just to underpin the notes of the bass line in"
  },
  {
    "start": 1612.96,
    "text": " this chord. That's the easiest thing to do. So I'm just going to put a wavetable on there,"
  },
  {
    "start": 1619.04,
    "text": " create a saw wave unsurprisingly, full sustain, pretty fast attack in mono and take down the"
  },
  {
    "start": 1626.4,
    "text": " filter and add a bit of unison which is going to create this nice bass sound. It could create"
  },
  {
    "start": 1632.48,
    "text": " some phase issues but because this is just a gentle break bass it's not as important as if"
  },
  {
    "start": 1638.16,
    "text": " it was the main bass. Let's just program in this bass line that follows the chords."
  },
  {
    "start": 1646.0,
    "text": " Probably there is a good octave."
  },
  {
    "start": 1648.24,
    "text": " There you can see it just brings in that energy in the low end, really quiet."
  },
  {
    "start": 1663.92,
    "text": " Just following those same bass notes. So let's listen to it now."
  },
  {
    "start": 1670.08,
    "text": " Oh, my computer's struggling for some reason. Not sure what's going on so I'm going to freeze the chords."
  },
  {
    "start": 1689.52,
    "text": " Epic, but also delicate and beautiful."
  },
  {
    "start": 1692.72,
    "text": " And now we need something that really works with that break in terms of a melody. So I'm going to create one more. Let's just duplicate this."
  },
  {
    "start": 1706.0,
    "text": " I won't bring in the break bass straight away in the break. That would be madness. Madness I say,"
  },
  {
    "start": 1711.76,
    "text": " because we need to build the energy back up. I might actually flatten this so we can further add"
  },
  {
    "start": 1720.48,
    "text": " filters to it. So if our break started we could actually have the high ends taken out like so,"
  },
  {
    "start": 1726.8,
    "text": " or we could do a bandpass filter. So if our break started like so."
  },
  {
    "start": 1738.96,
    "text": " It would be smoother and we'd filter in with this lushness."
  },
  {
    "start": 1745.28,
    "text": " I'd automate it to be smoother."
  },
  {
    "start": 1750.48,
    "text": " Let's create a piano riff for this. Much like in the Artback track Horizon. Let's call this piano riff."
  },
  {
    "start": 1758.48,
    "text": " And you could use a better piano to be honest than the one that comes with Ableton, but I'm going to use this anyway."
  },
  {
    "start": 1766.24,
    "text": " I'd probably use the contact piano with the giant preset. Really like that, but I'm going to use this one today."
  },
  {
    "start": 1773.84,
    "text": " And once again we are just going to work in the key that we're already in. So that would be F minor. Lovely."
  },
  {
    "start": 1781.84,
    "text": " And if we press scale we can never hit a wrong note. So let's create a really nice"
  },
  {
    "start": 1803.28,
    "text": " reverb."
  },
  {
    "start": 1806.16,
    "text": " But we need some epic reverb on this so I'm just going to use the"
  },
  {
    "start": 1810.0,
    "text": " global hall reverb that I created on an auxiliary channel."
  },
  {
    "start": 1813.76,
    "text": " Just with a five and a half second delay we'll see how that sounds."
  },
  {
    "start": 1823.04,
    "text": " Sounds good."
  },
  {
    "start": 1830.72,
    "text": " Simplicity is key."
  },
  {
    "start": 1833.76,
    "text": " Okay now let's get a bit of arrangement up in here. Up in this b***h."
  },
  {
    "start": 1847.52,
    "text": " Let's just duplicate this first part."
  },
  {
    "start": 1854.0,
    "text": " And we're going to start without this main riff and we're going to start with far fewer drums."
  },
  {
    "start": 1859.84,
    "text": " Okay no drums apart from the kick and the bass. So let's just do it. Synth riff is going to be filtered right down."
  },
  {
    "start": 1876.8,
    "text": " You could use a reference track for this of course."
  },
  {
    "start": 1879.92,
    "text": " It's all about building the energy slowly with the techno."
  },
  {
    "start": 1887.28,
    "text": " Let's start filtering this up here and bring in the second riff."
  },
  {
    "start": 1909.68,
    "text": " And then we could take this right back down when the beats come in."
  },
  {
    "start": 1913.8400000000001,
    "text": " I'd run this over a much longer period but just to give you an example of"
  },
  {
    "start": 1918.24,
    "text": " the kind of ebb and flow of energy you want to look for."
  },
  {
    "start": 1926.96,
    "text": " So let's just do this."
  },
  {
    "start": 1928.64,
    "text": " And then we can take this right back down when the beats come in."
  },
  {
    "start": 1933.1200000000001,
    "text": " And this might go on you know for a minute."
  },
  {
    "start": 1943.6000000000001,
    "text": " And this might go on you know for a minute."
  },
  {
    "start": 1949.2800000000002,
    "text": " Let's loop this bit."
  },
  {
    "start": 1954.3999999999999,
    "text": " Oh I know what we could do. Let's quickly get this in there. Break."
  },
  {
    "start": 1966.56,
    "text": " And now we can bring in these chords like this. I'm just doing this on the fly."
  },
  {
    "start": 1992.48,
    "text": " This would be working with this riff too. It all works."
  },
  {
    "start": 1997.2,
    "text": " So let's just do this."
  },
  {
    "start": 2001.52,
    "text": " Yes, yes. Let's increase that."
  },
  {
    "start": 2015.04,
    "text": " Yes."
  },
  {
    "start": 2026.72,
    "text": " And then you'd have a moment."
  },
  {
    "start": 2036.32,
    "text": " And this would be the build and then it would go back to the main drop."
  },
  {
    "start": 2042.3999999999999,
    "text": " You'd have some effects and drums."
  },
  {
    "start": 2051.12,
    "text": " Nice."
  },
  {
    "start": 2051.8599999999997,
    "text": " Okay I'm going to do a bit more work on this before I give it to you to download."
  },
  {
    "start": 2056.58,
    "text": " But they are the main constituent parts of that. So you can pick apart the project."
  },
  {
    "start": 2060.66,
    "text": " You can see the extra bits that I'm going to do on top of this."
  },
  {
    "start": 2063.2999999999997,
    "text": " And yeah I really hope you've enjoyed. Don't forget do download this if you want it."
  },
  {
    "start": 2067.38,
    "text": " And if you want this was actually a question from one of my students in the accelerator program."
  },
  {
    "start": 2071.2999999999997,
    "text": " We've helped our students get signed to labels such as Anjuna Deep, Anjuna Beats,"
  },
  {
    "start": 2075.54,
    "text": " Spinin. This never happened. So if you do want to get released on your favorite labels and you want"
  },
  {
    "start": 2080.1,
    "text": " to do that as quickly as possible do check out the program. Thank you so much for watching. If"
  },
  {
    "start": 2083.94,
    "text": " you enjoyed it like, share, subscribe, hit that notification bell and I'll catch you next time."
  },
  {
    "start": 2088.42,
    "text": " Until then, cheers and happy producing."
  }
]