[
  {
    "start": 0.0,
    "text": " In this video we're going to have a look at the delay device and walk through its various features."
  },
  {
    "start": 8.0,
    "text": " Delay is a versatile device that combines many useful features into an accessible interface."
  },
  {
    "start": 16.0,
    "text": " The dry-wet parameter sets the balance between the original dry signal and the delayed wet signal."
  },
  {
    "start": 31.0,
    "text": " The feedback parameter dials in how much of the device's output is fed back into the device's input."
  },
  {
    "start": 40.0,
    "text": " This is what causes the repeats that we often associate with delay effects."
  },
  {
    "start": 47.0,
    "text": " This parameter can reach a maximum of 95%."
  },
  {
    "start": 53.0,
    "text": " Clicking on the delay sync button will toggle the repeated audio between tempo synced 16th notes and millisecond values."
  },
  {
    "start": 69.0,
    "text": " Disabling the link button allows us to choose different delay times in the left and right channels."
  },
  {
    "start": 77.0,
    "text": " This freeze button will endlessly repeat the sound that is currently stored in the effects buffer,"
  },
  {
    "start": 84.0,
    "text": " and will ignore any input signal until the button is deactivated again."
  },
  {
    "start": 96.0,
    "text": " The filter section allows us to sculpt the sound of the repeats by filtering out the higher and lower frequencies."
  },
  {
    "start": 107.0,
    "text": " The modulation section underneath allows further creative control over the repeats generated by the device."
  },
  {
    "start": 117.0,
    "text": " We can dial in the speed of the modulation and apply individually to both the position of the filter or the speed of the repeats."
  },
  {
    "start": 127.0,
    "text": " The mode section allows us to decide how changes in delay time will be processed."
  },
  {
    "start": 136.0,
    "text": " The delay time is set to 0."
  },
  {
    "start": 149.0,
    "text": " Fade crossfades between new and old delay times."
  },
  {
    "start": 166.0,
    "text": " Selecting jump means that the delay time values suddenly update when the delay time is changed,"
  },
  {
    "start": 173.0,
    "text": " almost as if the delay times jump from one value to the other."
  },
  {
    "start": 185.0,
    "text": " Finally, with ping pong enabled, the delay lines will alternate between the left and right output channels."
  },
  {
    "start": 196.0,
    "text": " If you have older projects that include either the simple delay or ping pong delay devices,"
  },
  {
    "start": 209.0,
    "text": " these will be automatically converted to delay when you open your project in Live 10.1."
  }
]